stellarbeing22/stm32f1xx-drivers-/stm32f103xxDrivers/drivers/src/stm32f103xx_spi_drivers.c
/*
 * stm32f103xx_spi_drivers.c
 *
 *  Created on: Sep 14, 2025
 *      Author: stellarbeing22
 *
 *******************************************************************************
 *                              FUNCTION INDEX
 * ----------------------------------------------------------------------------
 *  1.  SPI_PeriClockControl()             - Enable or disable SPI peripheral clock
 *
 *  2.  SPI_init()                         - Initialize SPI peripheral
 *  3.  SPI_Deinit()                       - Reset SPI peripheral registers
 *
 *  4.  SPI_SendData()                     - Send data (blocking mode)
 *  5.  SPI_RecieveData()                  - Receive data (blocking mode)
 *  6.  SPI_SendData_IT()                  - Send data using interrupt (non-blocking)
 *  7.  SPI_RecieveData_IT()               - Receive data using interrupt (non-blocking)
 *
 *  8.  SPI_IRQInterruptConfig()           - Configure NVIC interrupt enable/disable for SPI
 *  9.  SPI_IRQPriorityConfig()            - Configure NVIC interrupt priority for SPI
 * 10.  SPI_IRQHandling()                  - Handle SPI interrupt and delegate to ISR helpers
 *
 * 11.  SPI_GetFlagStatus()                - Read status of a specific SPI flag
 * 12.  SPI_PeripheralControl()            - Enable or disable SPI peripheral
 * 13.  SPI_SSIConfig()                    - Configure internal slave select (SSI)
 * 14.  SPI_SSOEConfig()                   - Configure SS output enable (SSOE)
 * 15.  SPI_ClearOVRFlag()                 - Clear overrun (OVR) flag
 * 16.  SPI_AbortTransmission()            - Abort interrupt-driven SPI transmission
 * 17.  SPI_AbortReception()               - Abort interrupt-driven SPI reception
 *
 * 18.  SPI_ApplicationEventCallback()     - Application callback for SPI events
 *
 * --------------------------- INTERNAL (STATIC) ------------------------------
 * 19.  spi_txe_interrupt_handle()         - Handle TXE interrupt (transmit buffer empty)
 * 20.  spi_rxne_interrupt_handle()        - Handle RXNE interrupt (receive buffer not empty)
 * 21.  spi_ovr_err_interrupt_handle()     - Handle OVR error interrupt
 ******************************************************************************/



#include "stm32f103xx_spi_drivers.h"

static void spi_txe_interrupt_handle(SPI_Handler_t *pHandle);
static void spi_rxne_interrupt_handle(SPI_Handler_t *pHandle);
static void spi_ovr_err_interrupt_handle(SPI_Handler_t *pHandle);


/* GPIO peripheral clock */

/**
 * @fn                        - SPI_PeriClockControl
 *
 * @brief                     - Enables or disables the peripheral clock for the specified SPI peripheral.
 *
 * @param[in]                 - pSPIx  Base address of the SPI peripheral (e.g., SPI1, SPI2).
 * @param[in]                 - En_or_Di ENABLE to turn on the clock, DISABLE to turn it off (uses macros).
 *
 * @return                    - None
 *
 * @note                      - Must be called before initializing the SPI peripheral.
 */


void SPI_PeriClockControl(SPI_RegDef_t *pSPIx, uint8_t En_or_Di)
{

	//only 2 SPI periphral in stm32f103xx board
	if(En_or_Di == ENABLE)        //enabling clock
	{
		if((pSPIx == SPI1))
		{
			SPI1_PCLK_EN;
		}else if((pSPIx == SPI2))
		{
			SPI2_PCLK_EN;
		}
	}else                        //disabling clock
	{
		if((pSPIx = SPI1))
		{
			SPI1_PCLK_DI;
		}else if((pSPIx == SPI2))
		{
			SPI1_PCLK_DI;
		}
	}
}


/**
 * @fn                        - SPI_init
 *
 * @brief                     - Initializes the SPI peripheral according to the specified configuration in the SPI handle.
 *
 * @param[in]                 - pSPIHandle Pointer to the SPI handle containing SPI configuration settings.
 *
 * @return                    - None
 *
 * @note                      - Ensure peripheral clock is enabled before calling this function.
 */

void SPI_init(SPI_Handler_t *pSPIHandle)
{
	//Configuring CR1 register first
	uint32_t tempReg = 0;

	//Enable peripheral clock
	SPI_PeriClockControl(pSPIHandle->pSPIx,ENABLE);

	//1. configure DeviceMode
		tempReg = pSPIHandle->SPI_config.SPI_DeviceMode << SPI_CR1_MSTR;

	//2. configure BusConfig
		if(pSPIHandle->SPI_config.SPI_BusConfig == SPI_BUS_CONFIG_FDPX)
		{
			//BIDIMIDE = 0
			tempReg &= ~(1 << SPI_CR1_BIDIMODE);
		}else if(pSPIHandle->SPI_config.SPI_BusConfig == SPI_BUS_CONFIG_HDPX)
		{
			//BIDIMODE = 1
			tempReg |= (1 << SPI_CR1_BIDIMODE);
		}else if(pSPIHandle->SPI_config.SPI_BusConfig == SPI_BUS_CONFIG_SPX_RXONLY)
		{
			//BIDIMODE = 0
			tempReg &= ~(1 << SPI_CR1_BIDIMODE);
			//RXONLY = 1
			tempReg |=  (1 << SPI_CR1_RXONLY);
		}

	//3. configure Speed
		tempReg |= (pSPIHandle->SPI_config.SPI_Speed << SPI_CR1_BD);
	//4. configure DFF
		tempReg |= (pSPIHandle->SPI_config.SPI_DFF << SPI_CR1_DFF);
	//5. configure CPHA
		tempReg |= (pSPIHandle->SPI_config.SPI_CPHA << SPI_CR1_CPHA);
	//6. configure CPOL
		tempReg |= (pSPIHandle->SPI_config.SPI_CPOL << SPI_CR1_CPOL);
	//7. configure SSM
		tempReg |= (pSPIHandle->SPI_config.SPI_SSM << SPI_CR1_SSM);

		pSPIHandle->pSPIx->CR1 = tempReg;
}


/**
 * @fn                        - SPI_Deinit
 *
 * @brief                     - Resets the specified SPI peripheral, clearing all registers to their default reset state.
 *
 * @param[in]                 - pSPIx Base address of the SPI peripheral (e.g., SPI1, SPI2).
 *
 * @return                    - None
 */

void SPI_Deinit(SPI_RegDef_t *pSPIx)
{
	if((pSPIx == SPI1))
	{
		SPI1_REG_RESET;
	}else if((pSPIx == SPI2))
	{
		SPI2_REG_RESET;
	}
}



/* Data send and receive */

/*
 * Also called the blocking API because it waits for the whole bit to
 * trasnfer,and no other task can be done meanwhile.
 *
 *                     START
 *                       |
 *                       |
 *  -------------->  |len = 0?| ------------> |exit from the function|
 * 	|					 |	                              |
 * 	|					 |           		              |
 * 	|	 |wait until the Tx buffer is empty|		    |END|
 * 	|	 			     |
 * 	|	 			     |
 * 	|	 			   |DFF?| 1---------16 bit---------------
 * 	|	 			   0 | 8                                |
 * 	|	 			     | bit                              |
 * 	|	  |Load DR with 1 byte of data    |  |Load DR with 1 byte of data    |
 * 	|	  |And incriment the buffer adress|	 |And incriment the buffer adress|
 * 	|	                 |                                  |
 * 	|                    |                                  |
 * 	------------------|Len--| <--------------------------|len--|
 *
 * 	1. you can't put data inside the Tx buffer before its empty, otherwise
 * 	   corrupion can occur. Thus check the SPI_SR->TXE bit.
 * 	2. when the buffer is empty its automatically set to 1.
 * 	3. Similarly to read from Rx buffer, check the SPI_SR->RXNE bit.
 * 	4. if its 1, the Rx buffer is full then data can be read from it.
 * */




/**
 * @fn                        - SPI_SendData
 *
 * @brief                     - Sends data over SPI in blocking mode (polling).
 *
 * @param[in]                 - pSPIx Base address of the SPI peripheral.
 * @param[in]                 - TxBuffer Pointer to the data buffer to be transmitted.
 * @param[in]                 - len Number of bytes to transmit.
 *
 * @return                    - None
 *
 * @note                      - Function blocks until all data is transmitted.
 */

void SPI_SendData(SPI_RegDef_t *pSPIx, uint8_t *pTxBuffer, uint32_t len)
{

	while(len > 0)
	{
		//1Wait for the Tx flag
		while(SPI_GetFlagStatus(pSPIx, SPI_TXE_FLAG) == FLAG_RESET);

		//2. Check DFF, 0-> 8 bit, 1->16bit
		if(pSPIx->CR1 & (1<<SPI_CR1_DFF))
		{
			//16 bit format
			//1. Load the data into the data register
			pSPIx->DR = *((uint16_t *)pTxBuffer);
			len-=2; //twice because sent 2 bytes
			pTxBuffer+=2; //incriment the Tx buffer
		}else
		{
			//8 bit format
			//1. Load the data into the data register
			pSPIx->DR = *pTxBuffer;
			len--;//once because sent 1 byte
			pTxBuffer++;//incriment the Tx buffer
		}
	}
}


