stellarbeing22/stm32f1xx-drivers-/stm32f103xxDrivers/drivers/src/stm32f103xx_spi_drivers.c
/*
 *
 *                     START
 *                       |
 *                       |
 *  -------------->  |len = 0?| ------------> |exit from the function|
 * 	|					 |	                              |
 * 	|					 |           		              |
 * 	| |wait until the Rx buffer is non empty|		    |END|
 * 	|	 			     |
 * 	|	 			     |
 * 	|	 			   |DFF?| 1---------16 bit---------------
 * 	|	 			   0 | 8                                |
 * 	|	 			     | bit                              |
 * 	|	  |Read DR for 1 byte of data     |  |Read DR for 2 bytes of data    |
 * 	|	  |And incriment the buffer adress|	 |And incriment the buffer adress|
 * 	|	                 |                                  |
 * 	|                    |                                  |
 * 	------------------|Len--| <--------------------------|len--|
 *
 * */



/**
 * @fn                        - SPI_RecieveData
 *
 * @brief                     - Receives data from SPI in blocking mode (polling).
 *
 * @param[in]                 - pSPIx Base address of the SPI peripheral.
 * @param[in]                 - RxBuffer Pointer to the buffer where received data will be stored.
 * @param[in]                 - len Number of bytes to receive.
 *
 * @return                    - None
 *
 * @note                      - Function blocks until all data is received.
 */
void SPI_RecieveData(SPI_RegDef_t *pSPIx, uint8_t *pRxBuffer, uint32_t len)
{

	while(len > 0)
	{
		//1 Wait for the RXNE flag
		while(SPI_GetFlagStatus(pSPIx, SPI_RXNE_FLAG) == FLAG_RESET);

		//2. Check DFF, 0-> 8 bit, 1->16bit
		if(pSPIx->CR1 & (1<<SPI_CR1_DFF))
		{
			//16 bit format
			//1. Load the data from DR to address buffer
			*((uint16_t *)pRxBuffer) = (uint16_t)pSPIx->DR;
			len-=2; //twice because recived 2 bytes
			pRxBuffer+=2; //incriment the Rx buffer
		}else
		{
			//8 bit format
			//1. Read the data from DR to address buffer
			*pRxBuffer = pSPIx->DR;
			len--;//once because recived 1 byte
			pRxBuffer++;//incriment the Rx buffer
		}
	}
}




/**
 * @fn                        - SPI_SendData_IT
 *
 * @brief                     - Sends data over SPI in non-blocking interrupt mode.
 *
 * @param[in]                 - pSPIHandle Pointer to the SPI handle containing configuration and state.
 * @param[in]                 - TxBuffer Pointer to the data buffer to be transmitted.
 * @param[in]                 - len Number of bytes to transmit.
 *
 * @return                    - uint8_t Returns state of the SPI transmission (READY or BUSY).
 *
 * @note                      - Enables SPI interrupts to handle data transmission.
 */
uint8_t SPI_SendData_IT(SPI_Handler_t *pSPIHandle, uint8_t *TxBuffer, uint32_t len)
{
	uint8_t state = pSPIHandle->TxState;
	if(state != SPI_BUSY_IN_TX)
	{
		//1. Save the Tx buffer adn len information in some gobal variable
		pSPIHandle->pTxBuffer = TxBuffer;
		pSPIHandle->TxLen     = len;

		//2. Mark the SPI state as bust in transmission so that
		//   no other code can take over same SPI peripheral until the transmission is over.
		pSPIHandle->TxState   = SPI_BUSY_IN_TX;

		//3. Enable the TXEIE control bit to get interrupt whenever TXE flag is set in SR
		pSPIHandle->pSPIx->CR2 |= (1 << SPI_CR2_TXEIE);

		//4. Data transmossion will be handled by the ISR code (Will impliment late)
	}
	return state;
}



/**
 * @fn                        - SPI_RecieveData_IT
 *
 * @brief                     - Receives data over SPI in non-blocking interrupt mode.
 *
 * @param[in]                 - pSPIHandle Pointer to the SPI handle containing configuration and state.
 * @param[in]                 - RxBuffer Pointer to the buffer where received data will be stored.
 * @param[in]                 - len Number of bytes to receive.
 *
 * @return                    - uint8_t Returns state of the SPI reception (READY or BUSY).
 *
 * @note                      - Enables SPI interrupts to handle data reception.
 */
uint8_t SPI_RecieveData_IT(SPI_Handler_t *pSPIHandle, uint8_t *RxBuffer, uint32_t len)
{
	uint8_t state = pSPIHandle->RxState;
	if(state != SPI_BUSY_IN_RX)
	{
		//1. Save the Tx buffer adn len information in some gobal variable
		pSPIHandle->pRxBuffer = RxBuffer;
		pSPIHandle->RxLen     = len;

		//2. Mark the SPI state as bust in transmission so that
		//   no other code can take over same SPI peripheral until the transmission is over.
		pSPIHandle->RxState   = SPI_BUSY_IN_RX;

		//3. Enable the TXEIE control bit to get interrupt whenever TXE flag is set in SR
		pSPIHandle->pSPIx->CR2 |= (1 << SPI_CR2_RXNEIE);

		//4. Data transmossion will be handled by the ISR code (Will impliment late)
	}
	return state;
}


/*
 * Druing SPI communication, interrupts can be generated by the fillowing events
 * 1. Transmit Tx bugger readt to be loaded
 * 2. Data recived in Rx buffer
 * 3. Master mode faut (must avoid in single master mode)
 * 4. overrun error
 *
 * Interrupts can be enables and disabled seperately
 *
 *    =========================SPI Interrupt request======================
 *          Interrupt event      |   Event flag    |  Enable Control bit  |
 *    ====================================================================
 * 1. Transmit Tx buffer ready   |                 |                      |
 *    to be loaded               |_______TXE_______|________TXEIE_________|
 * 2. Data recived in Rx buffer  |_______RXNE______|________RXNEIE________|
 * 3. Master Mode failt event    |       MODF______|                      |
 * 4. Overrun error              |_______OVR_______|        ERRIE         |
 * 5. CRC error                  |_______CRCERR____|                      |
 * 6. TI frame format error      |_______FRE_______|______________________|
 *  ======================================================================
 *
 * */




/**
 * @fn                        - SPI_IRQInterruptConfig
 *
 * @brief                     - Configures the NVIC to enable or disable the specified IRQ number for SPI interrupts.
 *
 * @param[in]                 - IRQNumber SPI IRQ number to configure.
 * @param[in]                 - En_or_Di ENABLE to activate, DISABLE to deactivate.
 *
 * @return                    - None
 */
void SPI_IRQInterruptConfig(uint8_t IRQNumber, uint8_t En_or_Di)
{
	if(En_or_Di == ENABLE)
	{
		if(IRQNumber <=31)
		{
			//Configure ISER0 reg
			*NVIC_ISER0 |= (1 << IRQNumber);

		}else if(IRQNumber>=32 && IRQNumber < 64)
		{
			//Configure ISER1 reg
			*NVIC_ISER1 |= (1 << (IRQNumber % 32));

		}else if(IRQNumber>=64 && IRQNumber < 96)
		{
			//Configure ISER2 reg
			*NVIC_ISER2 |= (1 << (IRQNumber % 64));
		}
	}else
	{
		if(IRQNumber <=31)
		{
			//Configure ISER0 reg
			*NVIC_ICER0 |= (1 << IRQNumber);
		}else if(IRQNumber>=32 && IRQNumber < 64)
		{
			//Configure ISER1 reg
			*NVIC_ICER1 |= (1 << (IRQNumber % 32));
		}else if(IRQNumber>=64 && IRQNumber < 96)
		{
			//Configure ISER2 reg
			*NVIC_ICER2 |= (1 << (IRQNumber % 64));
		}
	}
}


/**
 * @fn                        - SPI_IRQPriorityConfig
 *
 * @brief                     - Sets the priority for the specified SPI interrupt in the NVIC.
 *
 * @param[in]                 - IRQNumber SPI IRQ number to configure.
 * @param[in]                 - IRQPriority Priority level (0 to 15, lower is higher priority).
 *
 * @return                    - None
 */
void SPI_IRQPriorityConfig(uint8_t IRQNumber,uint32_t IRQPriority)
{
	//First check the IPR register
		uint8_t IPRx = IRQNumber/4;
		uint8_t IPRx_section = IRQNumber%4;
		uint8_t Shift_ammount = (8*IPRx_section) + (8-PRIORITY_BITS);
	//	*(NVIC_IPR_BASEADDR + (IPRx)) &= ~(0xF<<Shift_ammount);
		*(NVIC_IPR_BASEADDR + (IPRx)) |= (IRQPriority<<Shift_ammount);

