stellarbeing22/stm32f1xx-drivers-/stm32f103xxDrivers/drivers/src/stm32f103xx_spi_drivers.c
		// NVIC_IPR_BASEADDR is a uint32_t* (each step = 4 bytes).
		// Adding IPRx already advances by 4*IPRx bytes to reach the correct IPR register.
		// If you also multiply IPRx by 4, you overshoot (4*4 = 16 bytes per step), causing wrong offsets and hard-to-debug errors.

}


/*			                       =============
 *  			                   | Enter ISR |
 *              			       =============
 *                          			 |
 *			                 | Understand which event|
 *			 ----------------| caused the interrupt  |------------------
 * 			 |               |  trigger (Check SR)   |                 |
 *           |                           |                             |
 *           |                 			 |                             |
 * |Interrupt is due to |    | Interrupt due to the  |   |Interrupt due to setting |
 * |SETTIGN OF RXNE flag|    |setting of the TXE flag|   |       of ERROR flag     |
 *           |                           |                             |
 *           |                           |                             |
 * |  Handle RXNE event |    |    Handle TXE flag    |   |        Handle error     |
 *
 * */




/**
 * @fn                        - SPI_IRQHandling
 *
 * @brief                     - Handles the SPI interrupt by checking and clearing relevant interrupt flags.
 *
 * @param[in]                 - pHandle Pointer to the SPI handle containing configuration and state.
 *
 * @return                    - None
 *
 * @note                      - Should be called inside the global IRQ handler for SPI.
 */
void SPI_IRQHandling(SPI_Handler_t *pHandle)
{
	uint8_t temp1, temp2;
	//first check the TXE
	temp1 = pHandle->pSPIx->SR & (1<<SPI_SR_TXE);
	temp2 = pHandle->pSPIx->CR2 & (1<<SPI_CR2_TXEIE);

	if(temp1&&temp2)
	{
		//TXE interrupt handling
		spi_txe_interrupt_handle(pHandle);
	}

	//first check the RXXE
	temp1 = pHandle->pSPIx->SR & (1<<SPI_SR_RXNE);
	temp2 = pHandle->pSPIx->CR2 & (1<<SPI_CR2_RXNEIE);
	if(temp1&&temp2)
	{
		//RXNE interrupt handling
		spi_rxne_interrupt_handle(pHandle);
	}

	//first check the ovr Error flag
	temp1 = pHandle->pSPIx->SR & (1<<SPI_SR_OVR);
	temp2 = pHandle->pSPIx->CR2 & (1<<SPI_CR2_ERRIE);
	if(temp1&&temp2)
	{
		//OVR interrupt handling
		spi_ovr_err_interrupt_handle(pHandle);
	}
}


/* Other Peripheral Control APIs */


/**
 * @fn                        - SPI_GetFlagStatus
 *
 * @brief                     - Returns the status of the specified SPI flag.
 *
 * @param[in]                 - pSPIx Base address of the SPI peripheral.
 * @param[in]                 - FlagName Name of the SPI flag to check (TXE, RXNE, OVR, etc.).
 *
 * @return                    - uint8_t FLAG_SET or FLAG_RESET.
 */
uint8_t SPI_GetFlagStatus(SPI_RegDef_t *pSPIx, uint32_t FlagName)
{
	if(pSPIx->SR & FlagName)
	{
		return FLAG_SET;
	}
	return FLAG_RESET;
}


/**
 * @fn                        - SPI_PeripheralControl
 *
 * @brief                     - Enables or disables the SPI peripheral.
 *
 * @param[in]                 - pSPIx Base address of the SPI peripheral.
 * @param[in]                 - En_Or_Di ENABLE to turn on, DISABLE to turn off.
 *
 * @return                    - None
 */
void SPI_PeripheralControl(SPI_RegDef_t *pSPIx, uint8_t En_Or_Di)
{
	if(En_Or_Di == ENABLE)
	{
		pSPIx->CR1 |= (1 << SPI_CR1_SPE);
	}else
	{
		pSPIx->CR1 &= ~(1 << SPI_CR1_SPE);
	}
}


/**
 * @fn                        - SPI_SSIConfig
 *
 * @brief                     - Configures the internal slave select (SSI) for the SPI peripheral.
 *
 * @param[in]                 - pSPIx Base address of the SPI peripheral.
 * @param[in]                 - En_Or_Di ENABLE to set SSI high, DISABLE to clear.
 *
 * @return                    - None
 *
 * @note                      - Necessary when the SPI is configured as a master to prevent MODF error.
 */
void SPI_SSIConfig(SPI_RegDef_t *pSPIx, uint8_t En_Or_Di)
{
	if(En_Or_Di == ENABLE)
	{
		pSPIx->CR1 |= (1 << SPI_CR1_SSI);
	}else
	{
		pSPIx->CR1 &= ~(1 << SPI_CR1_SSI);
	}
}



/**
 * @fn                        - SPI_SSOEConfig
 *
 * @brief                     - Configures the SS output enable (SSOE) for master SPI mode.
 *
 * @param[in]                 - pSPIx Base address of the SPI peripheral.
 * @param[in]                 - En_Or_Di ENABLE to enable automatic SS management, DISABLE to disable.
 *
 * @return                    - None
 */
void SPI_SSOEConfig(SPI_RegDef_t *pSPIx, uint8_t En_Or_Di)
{
	if(En_Or_Di == ENABLE)
	{
		pSPIx->CR2 |= (1 << SPI_CR2_SSOE);
	}else
	{
		pSPIx->CR2 &= ~(1 << SPI_CR2_SSOE);
	}
}




/**
 *
 *                        Handle TXE interrupt
 *                                |
 *                                |
 *       -------------------|8 bit/16bit|------------------
 * 	     |					 	                          |
 * 	     |					            		          |
 *  |Write 1 byte of data|                       |Write 2 byte of data|
 *  |to SPI Data Register|                       |to SPI Data Register|
 *       |					 	                          |
 * 	     |					            		          |
 * 	  |Len--| <-----------------------------------> |Len--, Len--|
 * 	                             |
 * 	                         |Len = 0?|---NO--------------
 * 	                         YES |                       |
 * 	                       |Close the|         |Wait till another TXE|
 * 	                       |SPI TX   |         |interrupt            |
 *
 */



/**
 * @fn                        - spi_txe_interrupt_handle
 *
 * @brief                     - Handles the SPI TXE (transmit buffer empty) interrupt for non-blocking transmission.
 *
 * @param[in]                 - pHandle Pointer to the SPI handle containing configuration and transmission state.
 *
 * @return                    - None
 *
 * @note                      - Internal driver function. Not to be called directly by application code.
 */
void spi_txe_interrupt_handle(SPI_Handler_t *pSPIHandle)
{
	//2. Check DFF, 0-> 8 bit, 1->16bit
	if(pSPIHandle->pSPIx->CR1 & (1<<SPI_CR1_DFF))
	{
		//16 bit format
		//1. Load the data into the data register
		pSPIHandle->pSPIx->DR = *((uint16_t *)pSPIHandle->pTxBuffer);
		pSPIHandle->TxLen-=2;//twice because sent 2 bytes
		pSPIHandle->pTxBuffer+=2; //incriment the Tx buffer
	}else
	{
		//8 bit format
		//1. Load the data into the data register
		pSPIHandle->pSPIx->DR = *pSPIHandle->pTxBuffer;
		pSPIHandle->TxLen--;//once because sent 1 byte
		pSPIHandle->pTxBuffer++;//incriment the Tx buffer
	}

