stellarbeing22/stm32f1xx-drivers-/stm32f103xxDrivers/drivers/src/stm32f103xx_spi_drivers.c
	if(!pSPIHandle->TxLen)
	{
		//TxLen is zero, so close the SPI comm. and inform the
		//application that TX is over

		SPI_AbortTransmission(pSPIHandle);
		SPI_ApplicationEventCallback(pSPIHandle, SPI_EVENT_TX_CMPLT);
	}
}


/** TODO: update this fow chart
 *
 *                        Handle RXNE interrupt
 *                                |
 *                                |
 *       -------------------|8 bit/16bit|------------------
 * 	     |					 	                          |
 * 	     |					            		          |
 *  |Write 1 byte of data|                       |Write 2 byte of data|
 *  |to SPI Data Register|                       |to SPI Data Register|
 *       |					 	                          |
 * 	     |					            		          |
 * 	  |Len--| <-----------------------------------> |Len--, Len--|
 * 	                             |
 * 	                         |Len = 0?|---NO--------------
 * 	                         YES |                       |
 * 	                       |Close the|         |Wait till another TXE|
 * 	                       |SPI TX   |         |interrupt            |
 *
 */


/**
 * @fn                        - spi_rxne_interrupt_handle
 *
 * @brief                     - Handles the SPI RXNE (receive buffer not empty) interrupt for non-blocking reception.
 *
 * @param[in]                 - pHandle Pointer to the SPI handle containing configuration and reception state.
 *
 * @return                    - None
 *
 * @note                      - Internal driver function. Not to be called directly by application code.
 */
void spi_rxne_interrupt_handle(SPI_Handler_t *pSPIHandle)
{
	//2. Check DFF, 0-> 8 bit, 1->16bit
	if(pSPIHandle->pSPIx->CR1 & (1<<SPI_CR1_DFF))
	{
		//16 bit format
		//1. Load the data from DR to address buffer
		*((uint16_t *)pSPIHandle->pRxBuffer) = (uint16_t)pSPIHandle->pSPIx->DR;
		pSPIHandle->RxLen-=2; //twice because recived 2 bytes
		pSPIHandle->pRxBuffer+=2; //incriment the Rx buffer
	}else
	{
		//8 bit format
		//1. Read the data from DR to address buffer
		*pSPIHandle->pRxBuffer = pSPIHandle->pSPIx->DR;
		pSPIHandle->RxLen--;//once because recived 1 byte
		pSPIHandle->pRxBuffer++;//incriment the Rx buffer
	}

	if(!pSPIHandle->TxLen)
	{
		//TxLen is zero, so close the SPI comm. and inform the
		//application that TX is over

		//clear out the TXEIE bit, and prevent interrupts from setting up the TXE flag
		SPI_AbortReception(pSPIHandle);
		SPI_ApplicationEventCallback(pSPIHandle, SPI_EVENT_RX_CMPLT);
	}
}


/**
 * @fn                        - spi_ovr_err_interrupt_handle
 *
 * @brief                     - Handles the SPI overrun (OVR) error interrupt, clearing flags and notifying application if needed.
 *
 * @param[in]                 - pHandle Pointer to the SPI handle containing configuration and error state.
 *
 * @return                    - None
 *
 * @note                      - Internal driver function. Not to be called directly by application code.
 */
void spi_ovr_err_interrupt_handle(SPI_Handler_t *pHandle)
{
	uint8_t temp;
	//1. Clear the OVR flag
	if(pHandle->TxState != SPI_BUSY_IN_TX)
	{
		temp = pHandle->pSPIx->DR;
		temp = pHandle->pSPIx->SR;
	}
	(void)temp;
	//i2. nform the application
	SPI_ApplicationEventCallback(pHandle, SPI_EVENT_OVR_ERR);

}



/**
 * @fn                        - SPI_ClearOVRFlag
 *
 * @brief                     - Clears the overrun (OVR) flag in the SPI status register.
 *
 * @param[in]                 - pSPIx Base address of the SPI peripheral.
 *
 * @return                    - None
 *
 * @note                      - Must be called after reading received data to prevent SPI from locking.
 */
void SPI_ClearOVRFlag(SPI_RegDef_t *pSPIx)
{
	uint8_t temp;
	temp = pSPIx->DR;
	temp = pSPIx->SR;
	(void)temp;
}


/**
 * @fn                        - SPI_AbortTransmission
 *
 * @brief                     - Aborts an ongoing SPI transmission in interrupt mode.
 *
 * @param[in]                 - pSPIHandle Pointer to the SPI handle containing configuration and state.
 *
 * @return                    - None
 */
void SPI_AbortTransmission(SPI_Handler_t *pSPIHandle)
{
	pSPIHandle->pSPIx->CR2 &= ~(1<<SPI_CR2_TXEIE);
	pSPIHandle->pTxBuffer = NULL;
	pSPIHandle->TxLen = 0;
	pSPIHandle->TxState = SPI_READY;
}


/**
 * @fn                        - SPI_AbortReception
 *
 * @brief                     - Aborts an ongoing SPI reception in interrupt mode.
 *
 * @param[in]                 - pSPIHandle Pointer to the SPI handle containing configuration and state.
 *
 * @return                    - None
 */

void SPI_AbortReception(SPI_Handler_t *pSPIHandle)
{
	pSPIHandle->pSPIx->CR2 &= ~(1<<SPI_CR2_RXNEIE);
	pSPIHandle->pRxBuffer = NULL;
	pSPIHandle->RxLen = 0;
	pSPIHandle->RxState = SPI_READY;
}


/**
 * @fn                        - SPI_ApplicationEventCallback
 *
 * @brief                     - Callback function invoked by the SPI driver on specific application events (e.g., transmission complete, reception complete, OVR error).
 *
 * @param[in]                 - pSPIHandle Pointer to the SPI handle generating the event.
 * @param[in]                 - AppEve Type of event that occurred (transmission complete, reception complete, etc.).
 *
 * @return                    - None
 *
 * @note                      - This is an weak implimentation, the application may overwrite it
 */
__weak void SPI_ApplicationEventCallback(SPI_Handler_t *pSPIHandle,uint8_t AppEve)
{
	//This is an weak implimentation, the application may overwrite it
}


